{"id":102,"date":"2021-03-23T12:03:37","date_gmt":"2021-03-23T12:03:37","guid":{"rendered":"http:\/\/localhost:8080\/wordpress\/wordpress\/?page_id=102"},"modified":"2021-03-31T06:34:03","modified_gmt":"2021-03-31T06:34:03","slug":"library-policies","status":"publish","type":"page","link":"https:\/\/library.ttu.edu.gh\/index.php\/library-policies\/","title":{"rendered":"Library Policy"},"content":{"rendered":"\n<p><style>\n    p{\n            color: black;\n      font-family: Open Sans, Helvetica, sans-serif;\n    }\n<\/style>\n<p><strong>MEMBERSHIP<\/strong><\/p><\/p>\n\n\n\n<p>The library is open to all legitimate students, academic staff, and non-academic staff of the Takoradi Technical University. Outsiders can be granted permission on request.<\/p>\n\n\n\n<p><strong>REGISTRATION PROCEDURE<\/strong><\/p>\n\n\n\n<p>Fresh students admitted into the University are required to register with the library before they qualify to borrow books. Non-registered members do not have borrowing rights but can use the library for reading and research.<\/p>\n\n\n\n<p><strong>READERS’ BAG TAGS<\/strong><\/p>\n\n\n\n<p>Readers are solely responsible for their bags. The Library shall not accept responsibility for any lost bags. Lost bag tags shall attract a replacement fee of Five Ghana Cedis (GH¢5.00) Readers will be asked to replace the tag before the bag will be given to them.<\/p>\n\n\n\n<p><em>Failure to report the loss of a book or ticket may delay a student’s clearance or even graduation.<\/em><\/p>\n\n\n\n<p><strong>RESERVED BOOKS<\/strong><\/p>\n\n\n\n<p>Library books recommended by lecturers to students are removed from the open shelves and put on reserved shelves. Such books are available for use in the library only<\/p>\n\n\n\n<p><strong>LOST BOOK(S)<\/strong><\/p>\n\n\n\n<p>Lost\/damaged book(s) must be reported to the Librarian\/his or her representatives immediately. Users will be given two weeks to look for the book(s).<\/p>\n\n\n\n<p><strong>BOOKS USED IN THE LIBRARY<\/strong><\/p>\n\n\n\n<p>Library books used should be left on the reading tables. Readers should not attempt to shelve any book after use. However, a book taken from the shelves and browsed through should be put back in its position on the shelves.<\/p>\n\n\n\n<p><strong>BORROWING REGULATIONS<\/strong><\/p>\n\n\n\n<p>Users of the Library are required to register with the Library to have borrowing rights.<\/p>\n\n\n\n<p>Registered users will be issued with a ticket that will enable them to borrow two books for a week.<\/p>\n\n\n\n<p>All books without the reference embossment or book pocket cards pasted in them are for borrowing.<\/p>\n\n\n\n<p>Readers are required to remove the book-card from the textbook, fill the necessary details in the space provided on the book card and insert it in their ticket. Only one bookrack must be inserted in a ticket<\/p>\n\n\n\n<p>Readers are solely responsible for their ticket(s). The library shall not accept responsibility for any lost ticket. However, a lost ticket will be replaced at a fee of Ghs5.00 upon application to the Librarian.<\/p>\n\n\n\n<p>Book(s) borrowed can be renewed if it is not demanded by another user. All returned book(s) must be taken to the circulation desk where the borrower’s tickets(s) will be returned in exchange for the returned item.<\/p>\n\n\n\n<p>A student ceases to be a user when he\/she is withdrawn from the University. Borrower’s ticket must be returned to the library as part of the clearance procedure at the end of the student’s program at the university.<\/p>\n\n\n\n<p>All books marked “Reference” (RF) are not to be borrowed and must be used only within the library. However, the student is allowed to do photocopies provided it does not infringe on the copyright law. Weekend borrowing of reference books is allowed on request. Such books must be returned to the library the following Monday by 10:00 am<\/p>\n\n\n\n<p><em>NB &#8211; All books in the Library Annex, as well as Faculty libraries, are for reference only.<\/em><\/p>\n\n\n\n<p><strong>RENEWAL OF BOOKS<\/strong><\/p>\n\n\n\n<p>A book may be renewed once. Any further renewal will have to be approved by the Librarian or his\/her representatives.<\/p>\n\n\n\n<p><strong>OVERDUE FINES<\/strong><\/p>\n\n\n\n<p>Books that overstay their due date stamped will be surcharged GHS0.50p per day for the first two weeks and GHC1.00 per day for the subsequent weeks. This is subject to review.<\/p>\n\n\n\n<p><strong>GENERAL LIBRARY RULES<\/strong><\/p>\n\n\n\n<p>Smoking and eating are not permitted in any part of the Library. The latter encourages infestation by pests and rodents and the latter is offensive to other library users. Only bottled water is allowed inside the library<\/p>\n\n\n\n<p>Leave all carrier bags at the library’s security checkpoint. Tie your bag with an identification tag or collect a tag on depositing your bag at the luggage bay.<\/p>\n\n\n\n<p>Gowns, hats, caps, raincoats, umbrellas, briefcases, etc. must be left in the baggage room at the entrance of the Library.<\/p>\n\n\n\n<p>On leaving the library, readers must show books in their possession to the staff at the entrance.<\/p>\n\n\n\n<p>It is an offence to take any library book out without proper authorization.<\/p>\n\n\n\n<p>Disciplinary action, including expulsion, will be taken against anyone found to have mutilated or stolen Library materials, including journals and books.<\/p>\n\n\n\n<p>Valuables including money should not be kept in handbags left at the entrance of the library and on the reading tables. The library will not accept responsibility for any loss of any item in a bag deposited at the baggage bay or on the reading table.<\/p>\n\n\n\n<p>The staff has the right to search users if they are in doubt of library property in users’ possession.<\/p>\n\n\n\n<p>Books must not be defaced by writing in them, or by any other means. Borrowers are responsible for books for which they have signed and they must pay for their loss or damage. Borrowers must browse through a book before signing for it.<\/p>\n\n\n\n<p>Students&#8217; project work and thesis are regarded as reference materials and cannot be borrowed, photocopied, photographed, or taken out of the library.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>MEMBERSHIP The library is open to all legitimate students, academic staff, and non-academic staff of the Takoradi Technical University. Outsiders can be granted permission on request. REGISTRATION PROCEDURE Fresh students admitted into the University are required to register with the library before they qualify to borrow books. Non-registered members do not have borrowing rights but [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":75,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"full-width.php","meta":[],"_links":{"self":[{"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/pages\/102"}],"collection":[{"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/comments?post=102"}],"version-history":[{"count":9,"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/pages\/102\/revisions"}],"predecessor-version":[{"id":395,"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/pages\/102\/revisions\/395"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/media\/75"}],"wp:attachment":[{"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/media?parent=102"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}