{"id":380,"date":"2021-03-31T05:34:37","date_gmt":"2021-03-31T05:34:37","guid":{"rendered":"https:\/\/library.ttu.edu.gh\/?page_id=380"},"modified":"2021-03-31T06:31:14","modified_gmt":"2021-03-31T06:31:14","slug":"welcome-message-from-librarian","status":"publish","type":"page","link":"https:\/\/library.ttu.edu.gh\/index.php\/welcome-message-from-librarian\/","title":{"rendered":"Welcome Message from librarian"},"content":{"rendered":"\n<style>\n    .wmfl{\n      text-align:justify; \n      color: black;\n      font-family: Open Sans, Helvetica, sans-serif;\n    }\n<\/style>\n<!-- wmfl - welcome message from librarian -->\n<p class=\"wmfl\">I am elated to welcome our cherished students, faculty, researchers, supporting staff, and members of the local community in which the University exists to the Takoradi Technical University Library website.<br><br>The university library website serves as a gateway to the full collection of information resources, facilities, and services provided by the library.<br><\/p><\/p>\n\n\n\n<p class=\"wmfl\">The library’s prime function is to provide high-quality, timely, and relevant information resources and services to support teaching, learning, and research needs of students, staff, and the university community.<\/p>\n\n\n\n<p class=\"wmfl\">The vision of Takoradi Technical University Library is to provide better resources, services, and facilities for library users, create a conducive environment for inquiry and activity that would aid excellence in teaching, learning, and applied research geared towards the achievement of academic excellence and research goals of the University.<\/p>\n\n\n\n<p class=\"wmfl\">The Library ensures that at all times, the ambiance is serene to enhance collaborative learning, the exercise of diverse viewpoints, and the crystallization of thoughts. The library portal creates a gateway for all faculty, students, and staff. It also gives users remote access to the information resources namely e-books, e-journals, online databases, institutional repository, research tools\/guides, etc.<\/p>\n\n\n\n<p class=\"wmfl\">The portal provides 24-hour live chat connected with our team of professional staff to receive research queries, and information assistance.<\/p>\n\n\n\n<p class=\"wmfl\">I humbly invite you to traverse and accustom yourself to the Takoradi Technical University website (library.ttu.edu.gh) where you will get access to:<\/p>\n\n\n\n<ul class=\"wmfl\"><li>Institutional Repository (TTU Space)<\/li><li>Africa Intellectual Database for Development Excellence (AIDDE)<\/li><li>Databases from Consortium of Academic and Research Libraries in Ghana (CARLIGH)<\/li><\/ul>\n\n\n\n<p class=\"wmfl\"><br>We would be pleased to receive your feedback to enable us to improve our services all the time.<\/p>\n\n\n\n<p class=\"wmfl\">Thank you.<\/p>\n\n\n\n<p class=\"wmfl\">Adwoa Kwegyiriba (Ph.D.)<\/p>\n\n\n<p style=\"opacity:0\">\nhello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello h ello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello hello\n<\/p>","protected":false},"excerpt":{"rendered":"<p>I am elated to welcome our cherished students, faculty, researchers, supporting staff, and members of the local community in which the University exists to the Takoradi Technical University Library website. The university library website serves as a gateway to the full collection of information resources, facilities, and services provided by the library. The library’s prime [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"full-width.php","meta":[],"_links":{"self":[{"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/pages\/380"}],"collection":[{"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/comments?post=380"}],"version-history":[{"count":5,"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/pages\/380\/revisions"}],"predecessor-version":[{"id":393,"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/pages\/380\/revisions\/393"}],"wp:attachment":[{"href":"https:\/\/library.ttu.edu.gh\/index.php\/wp-json\/wp\/v2\/media?parent=380"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}